src/CodyFact/Generator/Templates/envelope.xml.twig

{% apply spaceless %}

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ser="http://service.sunat.gob.pe"
                  xmlns:wsse="http://docs.oasisopen.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soapenv:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>{{ data.username }}</wsse:Username>
                <wsse:Password>{{ data.password }}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <ser:sendBill>
            <fileName>{{ data.fileName }}</fileName>
            <contentFile>{{ data.contentFile }}</contentFile>
        </ser:sendBill>
    </soapenv:Body>
</soapenv:Envelope>

{% endapply %}